ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    output: "values"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        dims: 3
        data_type: 16
        int32_data: 0
        int32_data: 16544
        int32_data: 16672
        int32_data: 16752
        int32_data: 16800
        int32_data: 16840
        name: "const_tensor"
      }
      type: TENSOR
    }
  }
  name: "test_constant"
  output {
    name: "values"
    type {
      tensor_type {
        elem_type: 16
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  version: 13
}
