ir_version: 13
producer_name: "NVIDIA ModelOpt Example Generator"
graph {
  node {
    input: "input"
    input: "input_scale"
    output: "input_quantized"
    name: "quantize_input"
    op_type: "QuantizeLinear"
  }
  node {
    input: "input_quantized"
    input: "input_scale"
    output: "input_dequantized"
    name: "dequantize_input"
    op_type: "DequantizeLinear"
  }
  node {
    input: "weight_fp8"
    input: "weight_scale"
    output: "weight_dequantized"
    name: "dequantize_weight"
    op_type: "DequantizeLinear"
  }
  node {
    input: "input_dequantized"
    input: "weight_dequantized"
    output: "output"
    name: "matmul"
    op_type: "MatMul"
  }
  name: "nvidia_modelopt_fp8_example"
  initializer {
    data_type: 1
    float_data: 0.05000000074505806
    name: "input_scale"
  }
  initializer {
    dims: 4
    dims: 4
    data_type: 17
    name: "weight_fp8"
    raw_data: "0\252%5\035-\262*3\2450\255*2\2356"
  }
  initializer {
    data_type: 1
    float_data: 1
    name: "weight_scale"
  }
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "output"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  value_info {
    name: "input_quantized"
    type {
      tensor_type {
        elem_type: 17
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 19
}
