ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
doc_string: "Test: FusedMatMul with dynamic-type inputs from custom domain op"
graph {
  name: "fusedmatmul_dynamic_type"

  node {
    input: "A"
    output: "A_custom"
    op_type: "CustomProcess"
    domain: "custom.test"
  }
  node {
    input: "A_custom"
    input: "B"
    output: "output"
    op_type: "FusedMatMul"
    domain: "com.microsoft"
    attribute {
      name: "alpha"
      f: 1.0
      type: FLOAT
    }
  }

  input {
    name: "A"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "B"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "output"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 14
}
opset_import {
  domain: "com.microsoft"
  version: 1
}
opset_import {
  domain: "custom.test"
  version: 1
}
